Divisions/Bayerdevponomarev.RA_Divisions/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2914af3c-ad8f-4719-8871-98d1a256b3fb">
  <name>СтруктураПредприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>RA_AdditionalFields_Division</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_ReportingUnit</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_ReportingUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_StrategicBusinessEntity</name>
    <type>
      <types>CatalogRef.RA_AdditionalFields_StrategicBusinessEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_ГФУ_ProfitCenter</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_КодSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RA_AdditionalFields_ItsCostCentre</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Divisions/Bayerdevponomarev.RA_Divisions/src/Enums/ТипыНазначений/ТипыНазначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="da661dff-cb85-42ed-be4c-dbf0de18d67a">
  <name>ТипыНазначений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="80791dbc-3243-4639-9962-54f64c8a1928">
    <name>Собственное</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Divisions/Bayerdevponomarev.RA_Divisions/src/Enums/ТипыОбъектовНазначений/ТипыОбъектовНазначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7fa3ceb0-3208-4ae6-88f3-139d9a7445fe">
  <name>ТипыОбъектовНазначений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="be32c2b5-652e-4b3c-ad7a-f1de02c9daa9">
    <name>Переработчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Divisions/Bayerdevponomarev.RA_Divisions/src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b861d222-a111-47b8-b5f4-45982f11877c">
  <name>Назначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>RA_AdditionalFields_CostCentre</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b9be1bdc-8d96-4fbf-9677-f1e361adc7d6">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="16e539c8-9b3a-479f-87f0-b0076e8c8b5f">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ab46529-e758-437a-963e-051fe1599aa6">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b39ceb3-3dc0-4808-baa8-e28e53b7ec36">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="202223c1-c9ff-42e7-a688-97e9cdb5eb13">
    <name>ТипНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b809ecd5-edb0-42a3-97aa-e71b0913e66f">
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="65c7272c-f446-4899-860c-d1ff2e932f27">
    <name>КонтролироватьТолькоНаличие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6e7ef6d8-5d2e-401c-ab2b-6609646e8377">
    <name>ДвиженияПоСкладскимРегистрам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b0acf7b-80e0-4182-b21a-4b8733be7f35">
    <name>ТипОбъектаНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Divisions/Bayerdevponomarev.RA_Divisions/src/Catalogs/СтруктураПредприятия/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура RA_AdditionalFieldsПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если RA_AdditionalFields_ItsCostCentre Тогда
		RA_AdditionalFields_СоздатьПроверитьНазначение();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура RA_AdditionalFields_СоздатьПроверитьНазначение()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Назначения.Ссылка
	|ИЗ
	|	Справочник.Назначения КАК Назначения
	|ГДЕ
	|	Назначения.RA_AdditionalFields_CostCentre = &RA_AdditionalFields_CostCentre";

	Запрос.УстановитьПараметр("RA_AdditionalFields_CostCentre", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НазначениеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		НазначениеОбъект = Справочники.Назначения.СоздатьЭлемент();	
	КонецЕсли;
	
	НазначениеОбъект.Наименование = Наименование;
	НазначениеОбъект.RA_AdditionalFields_CostCentre = Ссылка;
	НазначениеОбъект.ДвиженияПоСкладскимРегистрам = Истина;
	НазначениеОбъект.ТипНазначения = Перечисления.ТипыНазначений.Собственное;
	НазначениеОбъект.ТипОбъектаНазначения = Перечисления.ТипыОбъектовНазначений.Переработчик;
	НазначениеОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
